Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱམས་པ་བསྒོམས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་ཅིང་གནོད་པ་མི་བྱེད་པ་ཡིན་ཏེ།
en: “(1) Bodhisattvas do not manifest any aggression and do not harm any sentient being, because they cultivate love.

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་བསྒོམས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་ཅིང་གནོད་པ་མི་བྱེད་པ་ཇི་ལྟ་བུ་ཞེ་ན།
en: Pūrṇa, how is it that bodhisattvas do not manifest any aggression and do not harm any sentient being because they cultivate love?

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་བསྒོམ་པ་ན་སེམས་ཅན་རྣམས་ལ་བདག་གིས་ཡོངས་སུ་བསྐྱབ་པར་བྱའོ་སྙམ་པའི་བྱམས་པ་བསྐྱེད་པས་སེམས་ཅན་ལུས་དང་སེམས་སྡུག་བསྔལ་བདག་མཐོང་བར་གྱུར་པ་ན་འདི་སྐད་དུ་བདག་གིས་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་སེམས་ཅན་དེ་དག་འཁོར་བའི་སྡུག་བསྔལ་ལས་ཡོངས་སུ་བཟླས་ནས་སེམས་ཅན་དེ་དག་ལ་བདག་གིས་བདེ་བ་སྦྱིན་པར་བྱའོ།
en: When bodhisattvas cultivate love, they do so with the intention of protecting sentient beings. Therefore, when they perceive the physical or mental suffering of sentient beings, they think, ‘Through persistent diligence, I will liberate these beings from their saṃsāric sufferings and bring them happiness.

source: །བདག་གིས་དྲངས་ནས་འཁོར་བའི་སྡུག་བསྔལ་དང་བྲལ་བར་བྱའོ་ཞེས་སེམས་ཅན་རྣམས་ལ་དེ་ལྟ་བུའི་སེམས་སྐྱེད་པར་བྱེད་དོ། །དེ་ལྟ་བུའི་སེམས་བསྐྱེད་ནས་ཀྱང་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དག་ཡོངས་སུ་གོམས་པར་བྱེད་དོ།
en: Through my guidance, I will free them from their sufferings in saṃsāra!’ Having given rise to such an attitude, they then diligently train in the six perfections—the perfections of generosity, discipline, patience, diligence, concentration, and insight.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ཕུན་སུམ་ཚོགས་པར་བྱེད་དོ།
en: Pūrṇa, bodhisattvas gain mastery over the six perfections through the perfection of insight.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གང་ཡིན།
en: What is the perfection of insight of bodhisattvas?

source: ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུས་ནན་ཏན་བརྩོན་འགྲུས་སྐྱེད་པར་བྱེད་ཅེ་ན།
en: How do they develop persistent diligence through the perfection of insight?

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་སྙམ་དུ་ཆོས་གང་ནི་བདག་ཅེས་བྱ་བ་ཡིན།
en: “Pūrṇa, bodhisattvas reflect and investigate in this way:

source: ཆོས་གང་ནི་བདག་གི་ཞེས་བྱ་བ་ཡིན་སྙམ་དུ་སེམས་ཤིང་འཇལ་བར་བྱེད་དེ། དེ་ལྟར་སེམས་ཤིང་འཇལ་བ་ན་བདག་ཅེས་བྱ་བའི་ཆོས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ། བདག་གི་ཞེས་བྱ་བའི་ཆོས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་སྙམ་དུ་སེམས་པས་ཆོས་འདི་ལ་ནི་བདག་ཅེས་བྱ་བའི་ཆོས་ཀྱང་མེད་ལ། བདག་གི་ཞེས་བྱ་བའི་ཆོས་ཀྱང་མེད་དོ་སྙམ་དུ་སེམས་སོ།
en: ‘What are the phenomena called I and mine?’ When they reflect and investigate in that way, they realize, ‘I cannot find any phenomenon that could be called I or mine.’ In this way they conclude that there is neither I nor mine to be found within phenomena.

source: །བྱང་ཆུབ་སེམས་དཔའ་བདག་དང་བདག་གིར་འཛིན་པ་དང་བྲལ་བའི་ཕྱིར་ལུས་སྟོང་པ་ཉིད་དུ་རབ་ཏུ་ཤེས་སོ།
en: Since bodhisattvas are free from clinging to I and mine, they clearly understand that bodies are empty;

source: །ལུས་སྟོང་པའི་ཕྱིར་སེམས་ཅན་ཡང་སྟོང་ངོ་སྙམ་མོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: and therefore they conclude that, since bodies are empty, sentient beings are also empty. Why?

source: ཆོས་རྣམས་ལ་བདག་དང་བདག་གིར་འཛིན་པ་ཡང་སྟོང་པ་ཡིན་ན་སེམས་ཅན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་སྙམ་དུ་སེམས་པས་སོ།
en: Because they think that, if even the phenomena they had believed to be I and mine are empty, then it goes without saying that the same applies to sentient beings.

source: །བྱང་ཆུབ་སེམས་དཔས་བདག་དང་བདག་གིར་འཛིན་པ་དང་བྲལ་བའི་ཕྱིར་སེམས་ཅན་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since bodhisattvas are free from clinging to I and mine, they will therefore know that sentient beings are empty.

source: །སེམས་ཅན་སྟོང་པའི་ཕྱིར་གཟུགས་ཀྱི་ཕུང་པོ་ཡང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since sentient beings are empty, bodhisattvas will know that the aggregate of form is also empty.

source: །གཟུགས་ཀྱི་ཕུང་པོ་སྟོང་པའི་ཕྱིར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཕུང་པོ་ཡང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since the aggregate of form is empty, they will know that the aggregates of feeling, perception, formations, and consciousness are also empty.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་བདག་དང་བདག་གིར་འཛིན་པ་དང་འབྲལ་བའི་ཕྱིར་ལུས་ཀྱང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since bodhisattvas are free from clinging to I and mine, they will know that bodies are empty.

source: །ལུས་སྟོང་པའི་ཕྱིར་སེམས་ཅན་ཡང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since bodies are empty, they will know that sentient beings are also empty.

source: །སེམས་ཅན་སྟོང་པའི་ཕྱིར་ཕུང་པོ་རྣམས་ཀྱང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since sentient beings are empty, they will know that the aggregates are also empty.

source: །ཕུང་པོ་རྣམས་སྟོང་པའི་ཕྱིར་འདི་ལྟ་སྟེ། ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་། ནམ་མཁའ་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་ཏེ།
en: Since the aggregates are empty, they will know that the elements of earth, water, fire, wind, space, and consciousness are also empty.

source: སའི་ཁམས་ཀྱང་སའི་ཁམས་ཀྱི་མཚན་ཉིད་ཀྱིས་སྟོང་། ཆུ་དང་། མེ་དང་། རླུང་དང་། ནམ་མཁའ་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་མཚན་ཉིད་ཀྱིས་སྟོང་པས་ཁམས་འདི་དག་ལ་ནི་བྱེད་པ་ཡང་མེད་ལ་བྱ་བ་ཡང་མེད་དོ། །བྱང་ཆུབ་ཀྱང་མེད་དོ། །གང་བྱེད་པ་མེད་པའི་ཆོས་དེ་ནི་སྟོང་པ་ཡིན་ནོ་སྙམ་མོ།
en: They will conclude that the earth element is empty of the characteristics of the earth element, and that the elements of water, fire, wind, space, and consciousness are also empty of their respective characteristics. Thus they will understand that the elements are devoid of agent and action, that there is also no awakening, and that something devoid of agent must be empty.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ལ་བདག་དང་བདག་གིར་འཛིན་པ་སྤངས་པའི་ཕྱིར་ལུས་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: “Pūrṇa, since these bodhisattvas have abandoned clinging to I and mine, they will know that bodies are emptiness.

source: །ཕུང་པོ་རྣམས་སྟོང་པའི་ཕྱིར་ཁམས་རྣམས་ཀྱང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since the aggregates are empty, they will know that the elements are also emptiness.

source: །ཁམས་རྣམས་སྟོང་པའི་ཕྱིར་སྐྱེ་མཆེད་རྣམས་ཀྱང་སྟོང་པ་ཉིད་དུ་རིག་པར་འགྱུར་རོ།
en: Since the elements are empty, they will know that the sense sources are also emptiness.

source: །སྐྱེ་མཆེད་རྣམས་སྟོང་པའི་ཕྱིར་སྐྱེ་མཆེད་རྣམས་ཀྱི་མཚན་ཉིད་ཀྱང་སྟོང་ཞིང་སྐྱེ་མཆེད་རྣམས་ལ་བྱེད་པ་མེད་པ་དང་། བྱ་བ་མེད་པ་ཉིད་དུ་རིག་པར་འགྱུར་ཏེ།
en: Since the sense sources are empty, they will know that the characteristics of the sense sources are also empty, and that the sense sources are devoid of agent and action.

source: ཆོས་གང་བྱེད་པ་དང་བྱ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྟོང་པ་ཡིན་ནོ་སྙམ་མོ།
en: They will then conclude that something devoid of agent and action is empty.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་ལྟ་བར་བྱེད་དོ།
en: “Pūrṇa, in that manner, bodhisattvas perceive all phenomena as being emptiness.

source: །ཆོས་ཐམས་ཅད་སྟོང་པར་ལྟ་བའི་ཚེ་ཆོས་རྣམས་ལ་ངོ་བོ་ཉིད་ཀྱིས་ཞེ་སྡང་སྐྱེ་བའི་གནས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: When they perceive all phenomena as being empty, they do not view any phenomenon as essentially being a basis for developing anger.

source: གང་པོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱམས་པ་ཆེན་པོ་ལུས་སྟོང་པ་ཉིད་དུ་རིག་པའི་བྱམས་པ་དང་། སེམས་ཅན་སྟོང་པ་ཉིད་དུ་རིག་པའི་བྱམས་པ་དང་། ཕུང་པོ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་རྣམས་སྟོང་པ་ཉིད་དུ་རིག་པའི་བྱམས་པ་ཞེས་བྱའོ།
en: Pūrṇa, this is known as the great love of the bodhisattva great beings, the love that knows that bodies are empty, the love that knows that sentient beings are empty, and the love that knows that the aggregates, sense sources, and elements are empty.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་ལྟ་བུའི་བྱམས་པ་སྒོམ་པ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཀྱི་བྱམས་པ་སྒོམ་པ་ཞེས་བྱའོ།
en: Such a cultivation of love is known as the cultivation of love that understands the emptiness of all phenomena.

source: །གང་པོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཆེན་པོ་སྒོམ་པ་ཞེས་བྱའོ།
en: Pūrṇa, it is also known as the cultivation of the great love of bodhisattvas.

source: །འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་དང་བདག་གིར་འཛིན་པ་དང་བྲལ་བའི་སེམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཤིན་ཏུ་འདུན་པ་བསྐྱེད་ནས།
en: “With a mind free from clinging to I and mine, bodhisattvas give rise to a resolute aspiration to reach unsurpassed and perfect awakening.

source: སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པར་བྱེད་པས་སེམས་ཅན་གང་འདི་ལྟར་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ཁོང་དུ་མ་ཆུད་པ་དག་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་གོ་ཆ་ཆེན་པོ་བགོས་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོ་སྤྱོད་པ་ཞེས་བྱ་སྟེ།
en: Since they have developed great compassion for sentient beings, they don the great armor in order to induce an understanding of the true characteristics of phenomena in those who do not understand them. This is known as the great compassionate conduct of bodhisattvas.

source: བདག་གིས་བསྐྱབ་པར་བྱའོ་སྙམ་དུ་སེམས་པའི་ཕྱིར་བྱམས་པ་ཞེས་བྱའོ།
en: Since they think, ‘I will protect them,’ this is known as love.

source: །བདག་གིས་དྲང་བར་བྱའོ་སྙམ་དུ་སེམས་པའི་ཕྱིར་སྙིང་རྗེ་ཞེས་བྱ་སྟེ།
en: Since they think, ‘I will guide them,’ this is known as compassion.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་ལྟ་བུའི་བྱམས་པ་ཆེན་པོ་དང་ལྡན་པ་གང་ཡིན་པ་དེས་ནི་སེམས་ཅན་རྣམས་ཀྱི་མགོན་དང་། སྐྱབས་དང་། གནས་དང་། གླིང་དང་། མཐར་ཕྱིན་པའི་གནས་བྱེད་པར་འགྱུར་བས་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟ་བུའི་བྱམས་པ་ཆེན་པོ་བསྒོམ་པར་བྱའོ།
en: Bodhisattvas who possess such a great love are the protectors, refuges, supports, havens, and saviors of sentient beings. Therefore, bodhisattvas should cultivate such great love.

source: །སེམས་ཅན་རྣམས་ལ་རྗེས་སུ་ཆགས་པ་ཡང་མེད་ལ། ཁོང་ཁྲོ་བ་ཡང་མི་སྐྱེད་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་སྟོང་པའི་བྱམས་པ་ཞེ་སྡང་མེད་པ་ཞེས་བྱའོ།
en: This freedom from attachment and aggression toward sentient beings is known as the bodhisattvas’ angerless love for empty sentient beings.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་གང་བྱམས་པའི་རྒྱུ་དང་། བྲལ་བའི་རྒྱུ་དང་། སྟོང་པའི་རྒྱུས་ཆོས་རྣམས་སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པ་ལ་འཇུག་པར་འགྱུར་བ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཆེན་པོ་སྒོམ་པ་ཞེས་བྱའོ།
en: “Pūrṇa, when bodhisattvas are introduced to the absence of arising and ceasing of phenomena by means of love, freedom, and emptiness, that is known as the bodhisattvas’ cultivation of great love.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་དེ་ལྟར་ཆོས་རྣམས་རབ་ཏུ་རྟོགས་པར་གྱུར་པ་དེ་ལ་བདུད་དང་བདུད་ཀྱི་འཁོར་རྣམས་ཀྱིས་ཚུགས་པར་མི་འགྱུར་ཏེ།
en: Bodhisattvas who completely realize phenomena in this way will never be harmed by Māra or by his entourage.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་དང་པོ་འདི་དང་ལྡན་པར་གྱུར་པ་དེ་ནི་ཡོན་ཏན་ཐམས་ཅད་ལ་སྒྲིབ་པའི་འཆིང་བ་རྣམས་ཡོངས་སུ་གཅོད་པར་བྱེད་དོ། །ཡོན་ཏན་གྱི་འཆིང་བ་ཡོངས་སུ་བཅད་པའི་ཕྱིར་མཉམ་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་འཐོབ་པར་འགྱུར་རོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Bodhisattvas who possess this first quality sever the fetters that obscure all excellent qualities. Because they sever the fetters that obscure such qualities, they will attain all the perfections of sameness.” At that moment, the Blessed One uttered these verses to explain this clearly:

source: བྱང་ཆུབ་སེམས་དཔས་ཕུང་པོ་དང་། །ཁམས་དང་སྐྱེ་མཆེད་དེ་དག་ལ། །བདག་མེད་པར་ནི་རྟག་ཤེས་པ། །བྱམས་སྒོམ་སྟོང་པར་ལྟ་བར་བྱེད།
en: “Continuously understanding That the aggregates, elements, And sense sources are devoid of self, Bodhisattvas cultivate love and the view of emptiness.

source: །བདག་དང་བདག་གི་ཆོས་གཉིས་དག །ངེས་པར་ཡང་དག་དམིགས་སུ་མེད།
en: “Decidedly, neither an I nor a mine Can be apprehended as phenomena.

source: །ཆོས་རྣམས་དམིགས་སུ་མེད་པས་ན། །བྱམས་པའི་སེམས་ནི་སྒོམ་པར་བྱེད།
en: Since no phenomena can be apprehended, Bodhisattvas cultivate the attitude of love.

source: །ཆོས་རྣམས་ལ་ནི་མི་གནས་ཏེ། །མི་གནས་པ་ཡང་མ་ཡིན་པ།
en: “They do not dwell on phenomena, Yet that is not a non-dwelling.

source: །འདི་ནི་སངས་རྒྱས་རྣམས་ཀྱི་ལམ།
en: This is the path of the buddhas.

source: །ཆོས་རྣམས་མི་གནས་པ་ཞེས་བྱ།
en: It is known as not dwelling on phenomena.

source: །བླ་མེད་བཟོད་པ་གང་འཐོབ་པ།
en: “Those who have developed unsurpassed patience

source: །ཆོས་རྣམས་ཡང་དག་མཚན་ཉིད་བཟོད།
en: Accept the true characteristics of phenomena.

source: །ཆོས་རྣམས་སྐྱེ་འགག་མེད་དོ་ཞེས། །དོན་གྱི་ཚུལ་ནི་རབ་ཏུ་རྟོགས།
en: They completely realize their meaning—The absence of arising and ceasing of phenomena.

source: །བློ་གྲོས་ཆེན་པོ་ལྡན་པ་དག །ཆོས་འདི་ལ་ནི་སྟེན་བྱེད་ན།
en: “If those endowed with great intelligence Rely on this Dharma teaching,

source: །རྟག་ཏུ་གྱ་ནོམ་གཟུངས་ཐོབ་ཅིང་། །སྤོབས་པ་དག་ཀྱང་ཐོབ་པར་འགྱུར།
en: They will permanently reach the excellent attainments Of recall and eloquence.

source: །རྟག་པར་སངས་རྒྱས་ཕྲད་པར་འགྱུར།
en: “They will always encounter the buddhas

source: །ཆོས་རྣམས་ཀུན་གྱི་དོན་རིག་འགྱུར།
en: And understand the meaning of all Dharma teachings.

source: །བླ་མེད་བྱང་ཆུབ་འཐོབ་པར་འགྱུར།
en: Will attain unsurpassed awakening.

source: །གཞན་ཡང་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཆོད་རྟེན་དག་ལ་མཆོད་པ་བྱེད་པས་གུས་པའི་སེམས་ཀྱིས་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། སྤོས་ཀྱི་ཕྱེ་མ་དང་། གདུགས་དང་། བ་དན་དང་། རོལ་མོ་སིལ་སྙན་དང་། མཆོད་པའི་ཡོ་བྱད་གྱ་ནོམ་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་མཆོད་པར་བྱེད་དེ།
en: “Furthermore, Pūrṇa, (2) bodhisattva great beings worship the reliquaries of the thus-gone ones with persistent diligence. They respectfully offer them flowers, perfumes, garlands, ointments, fragrant powders, parasols, flags, and music, as well as various other kinds of excellent offerings.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་གཉིས་པ་འདི་དང་ལྡན་པར་གྱུར་ན་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཐོབ་པར་འགྱུར་རོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Bodhisattvas who possess this second quality will achieve all excellent qualities.” At that moment, the Blessed One uttered these verses to explain this clearly:

source: བྱང་ཆུབ་སེམས་དཔའ་མེ་ཏོག་སྤོས། །བ་དན་དང་ནི་གདུགས་མཆོག་གིས། །བློ་མཆོག་མཆོད་རྟེན་རབ་མཆོད་ནས། །ཤེས་རབ་མཆོག་ནི་ཚོལ་བར་བྱེད།
en: “Bodhisattvas should pursue supreme insight, While worshiping the reliquaries Of those who possess a supreme mind, By offering them the finest flowers, perfumes, flags, and parasols.

source: །བསོད་ནམས་འདི་ཡི་རྐྱེན་གྱིས་ནི། །བྱད་བཞིན་དག་ནི་མཛེས་པར་འགྱུར།
en: “Through this merit, Their bodies will always be handsome.

source: །ནོར་ཕྱུག་རིན་ཆེན་རབ་ཏུ་མང་།
en: They will be wealthy, affluent,

source: །འཁོར་ནི་ཕུན་སུམ་ཚོགས་པར་འགྱུར།
en: And surrounded by excellent retinues.

source: །བྱང་ཆུབ་ཉིད་དུ་ངེས་གྱུར་ཅིང་།
en: “They are certain to reach the state of awakening,

source: །རྟག་ཏུ་ཆོས་ལ་རབ་ཏུ་གནས།
en: And will always observe the Dharma.

source: །སྐྱེ་བ་དག་ནི་ཐམས་ཅད་དུ།
en: Throughout all their lives,

source: །ཡོན་ཏན་འཕེལ་ཞིང་མཐོན་པོར་འགྱུར།
en: Their qualities will expand and become supreme.

source: །རྒྱལ་པོ་རྣམས་ཀྱིས་བཀུར་བྱེད་ཅིང་།
en: “They will be revered by kings,

source: །ལྷ་ཀླུས་རྟག་ཏུ་དྲན་པར་འགྱུར། །སེམས་ཅན་ཐམས་ཅད་ཀུན་གྱིས་ཀྱང་། །བཀུར་སྟི་དག་ནི་བྱེད་པར་འགྱུར།
en: They will always be remembered by gods and nāgas, And they will be respected By all sentient beings.

source: །འདས་དང་ད་ལྟར་བཞུགས་པ་ཡི། །སངས་རྒྱས་དག་ལ་མཆོད་བྱེད་ན། །སྐྱེ་བ་ཀུན་དུ་མཆོད་པ་འཐོབ། །རྟག་པར་མི་ཁོམ་མེད་པར་སྐྱེ།
en: “Since they worship The past and present buddhas, They will themselves be worshiped throughout all their lives, And they will never be reborn within the states that lack freedom.

source: །གཞན་ཡང་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་རྟག་པར་བརྩོན་པའི་སེམས་ཀྱིས་ཆོས་ལ་མཆོད་པར་བྱེད་དོ།
en: “Furthermore, Pūrṇa, (3) bodhisattva great beings always diligently worship the Dharma.

source: །ཆོས་ཞེས་བྱ་བ་ནི་གང་།
en: What is meant by Dharma?

source: ཇི་ལྟར་ན་ཆོས་ལ་མཆོད་པར་བྱེད་ཅེ་ན།
en: And how do they worship the Dharma?

source: དེ་ལ་ཆོས་ཞེས་བྱ་བ་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། བསམ་གཏན་བཞི་དང་། ཞི་གནས་དང་། ལྷག་མཐོང་དང་། རིག་པ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། ཟད་པའི་ཡེ་ཤེས་དང་། མི་སྐྱེ་བའི་ཡེ་ཤེས་གང་ཡིན་པ་འདི་ནི་ཆོས་ཞེས་བྱའོ།
en: Dharma refers to the four applications of mindfulness, four relinquishments, four bases of miraculous displays, five faculties, five powers, seven limbs of awakening, eight limbs of the noble path, four concentrations, tranquility, insight, knowledge, liberation, three doors of liberation, wisdom of exhaustion, and unborn wisdom.

source: །ཇི་ལྟར་མཆོད་པར་བྱེད་ཅེ་ན།
en: How do they worship the Dharma?

source: ཆོས་དེ་དག་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་མངོན་པར་སྒྲུབ་ཅིང་རྗེས་སུ་འབྲངས་ནས་འགལ་བ་མེད་པར་འདུན་པ་དང་། བརྩོན་འགྲུས་བསྐྱེད་དེ་ཕུན་སུམ་ཚོགས་པར་མངོན་པར་སྒྲུབ་པ་གང་ཡིན་པ་འདི་ནི་ཆོས་ལ་མཆོད་པ་ཞེས་བྱའོ།
en: Worshiping the Dharma consists in aspiring for the Dharma without contradicting it, by practicing and following the teachings in accordance with the way they are taught, and perfectly accomplishing them with diligence.

source: །གཞན་ཡང་གང་པོ་ཆོས་ལ་མཆོད་པ་ཞེས་བྱ་བ་ལ། ཆོས་ནི་མདོ་སྡེ་འདི་ལྟ་བུ་དག་ཡིན་ལ། དེ་ལ་མངོན་པར་ཡིད་ཆེས་ཤིང་ཡིད་ལ་སེམས་པ་དང་། རྣམ་པར་འབྱེད་པ་དང་། རྗེས་སུ་འབྲང་ཞིང་སེམས་ཀྱིས་འགལ་བར་མི་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་ཆོས་ལ་མཆོད་པ་ཞེས་བྱ་སྟེ།
en: Furthermore, Pūrṇa, when we say, ‘worshiping the Dharma,’ Dharma refers to such discourses, and worshiping the Dharma consists in trusting them, contemplating them, analyzing them, following them, and not contradicting them.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་གསུམ་པ་འདི་དང་ལྡན་པར་གྱུར་ན་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་འཐོབ་པར་འགྱུར་རོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Bodhisattvas who possess this third quality will achieve all excellent qualities.” At that moment, the Blessed One uttered these verses to explain this clearly:

source: རྟག་ཏུ་ཆོས་མཆོད་བརྩོན་བྱེད་པས། །ཇི་སྐད་བསྟན་པ་བཞིན་དུ་གནས། །ཟབ་མོ་སྟོང་པའི་ཆོས་ཐོས་ན། །སེམས་ཀྱིས་འགལ་བར་ཡོང་མི་བྱེད།
en: “Bodhisattvas should diligently worship the Dharma, Follow it in the way it is taught, And avoid mentally opposing the teachings On profound emptiness when they hear them.

source: །དེ་ཕྱིར་ལུས་ནི་རྟག་མཛེས་ཤིང་། །སྤོབས་པ་དག་ཀྱང་འཐོབ་པར་འགྱུར།
en: “Then their bodies will always be handsome, And they will attain eloquence as well.

source: །ངས་ནི་ཇི་སྐད་བསྔགས་པའི་ཆོས། །དེ་ནི་རབ་ཏུ་འཕེལ་བར་བྱེད།
en: They will propagate far and wide The Dharma teachings that I extol.

source: །གཞན་ཡང་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་རབ་ཏུ་བརྩོན་པའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་འཕགས་པའི་ཚོགས་རྣམས་ལ་མཆོད་པ་བྱེད་པས་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། སྤོས་ཀྱི་ཕྱེ་མ་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། གོས་དང་། བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། འཚོ་བའི་ཡོ་བྱད་དག་དང་། གཙུག་ལག་ཁང་དང་། ཀུན་དགའ་ར་བ་དང་། འཆགས་དང་། ཁྲུས་ཀྱི་རྫིང་དང་། ཁྲོན་པ་དང་། ལས་བྱེད་པའི་མི་དང་། འདི་ལྟ་བུ་ལ་སོགས་པ་གཞན་ཡང་མཆོད་པའི་ཡོ་བྱད་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་འདི་ལྟར་འཕགས་པའི་ཚོགས་རྣམས་ལ་མཆོད་པར་བྱེད་དེ།
en: “Furthermore, Pūrṇa, (4) bodhisattva great beings worship the noble assemblies of thus-gone ones with intense diligence by offering them flowers, perfumes, garlands, fragrant powders, ointments, parasols, victory banners, flags, clothing, food, drinks, bedding, medicines, other necessities, temples, gardens, promenades, bathing ponds, wells, and servants, as well as various other kinds of offerings.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་བཞི་པོ་འདི་དང་ལྡན་པར་གྱུར་ན་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་འཐོབ་པར་འགྱུར་རོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རབ་ཏུ་གསལ་བར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Bodhisattvas who possess this fourth quality will achieve all excellent qualities.” At that moment, the Blessed One uttered these verses to explain this clearly:

source: མཆོད་པའི་ཡོ་བྱད་མཆོག་དམ་པས། །འཕགས་པའི་ཚོགས་ནི་མཆོད་བྱེད་པས། །བསོད་ནམས་འདི་ཡི་རྐྱེན་གྱིས་ནི། །སྐྱེ་བ་ཀུན་ཏུ་ལོངས་སྤྱོད་ལྡན། །
en: “Bodhisattvas who worship the noble assemblies With the most sublime offerings Will, through the conditions produced by this merit, Enjoy material possessions throughout all their lives.

source: ལུས་ཀྱི་ཁ་དོག་རབ་མཛེས་ཤིང་།
en: “Their bodies will be handsome;

source: །སྤོབས་པ་དག་ཀྱང་འཐོབ་པར་འགྱུར།
en: They will attain eloquence,

source: །ཡོན་ཏན་རྣམས་ནི་ཕུན་ཚོགས་ཤིང་།
en: Develop excellent qualities,

source: །དྲང་པོའི་སེམས་ཀྱིས་མཆོད་བྱས་ཤིང་། །བདག་དང་བདག་གི་མེད་པས་ན། །ཤེས་པ་འདི་ཡི་རྒྱུ་རྐྱེན་གྱིས། །སྐྱེ་བ་ཀུན་ཏུ་མཆོད་པ་འཐོབ། །
en: “Because of their sincere worship And their understanding of the absence of I and mine, They will, as a consequence, Be worshiped throughout all their lives.

source: སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས་པ་ཡི། །ཆོས་བཞི་དག་ལ་རྟག་བསྟེན་ན།
en: “If bodhisattvas constantly rely on these four qualities, Which the buddhas praise,

source: །སྐྱེ་བ་ཀུན་ཏུ་ཆོ་རིགས་བཙུན། །ཡོན་ཏན་དག་ནི་མངོན་ཐོབ་འཕགས།
en: They will, in all their lives, be born into honorable families, And their excellent qualities will vastly increase.

source: །ཕྱིར་མི་ལྡོག་པའི་ལེའུ་སྟེ་གསུམ་པའོ།། །།
en: This was the third chapter, Irreversible Progress.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་གང་པོ་ལ་བཀའ་སྩལ་པ། གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པས་རྟག་པར་ཆོས་བཞི་པོ་འདི་དག་ལ་བསྟེན་ཅིང་གོམས་པར་བྱས་ན་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱང་ཕུན་སུམ་ཚོགས་པར་ཡོངས་སུ་སྡུད་པར་འགྱུར་ལ། དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་ཡང་རབ་ཏུ་ལྡན་པར་འགྱུར་རོ།
en: “Pūrṇa,” continued the Blessed One, “if bodhisattva great beings who are genuinely following the Great Vehicle constantly rely on and familiarize themselves with four qualities, they will gather all virtues in the most perfect manner, and they will possess all the roots of virtue.

source: གང་པོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཐེག་པ་ཆེན་པོར་སེམས་བསྐྱེད་པས་བཟོད་པ་སྒྲུབ་པའི་ཆོས་ལ་བསྟེན་ཅིང་བསྒོམ་པར་བྱའོ།
en: “Pūrṇa, (1) noble sons and daughters who have given rise to the mind set on awakening within the Great Vehicle should rely on and cultivate the practice of patience.

source: །དེ་ལྟར་བཟོད་པའི་ཆོས་སྒོམ་པ་ན་གལ་ཏེ་སེམས་མཉམ་པར་གྱུར་ན་ཤིན་ཏུ་མཉམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱང་ཐོབ་པར་འགྱུར་ལ། སེམས་ཅན་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཐོབ་པར་འགྱུར་ཏེ།
en: As they cultivate patience, if their minds are in a state of equanimity, they will attain the perfections of that profound sameness, as well as the perfection of the sameness of all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་སེམས་མཉམ་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཡེ་ཤེས་མཉམ་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པར་གྱུར་པ་ན། གལ་ཏེ་འགྲོའམ། འགྲེང་ངམ། འདུག་གམ། ཉལ་ལམ། གཉིད་ལོག་གམ། སད་པའི་ཚེ་ཡང་རུང་སྟེ། གཅིན་གྱི་བུམ་པའམ། དུག་གི་བུམ་པའམ། ཁུ་ཚན་གྱི་བུམ་པའམ། ཕྱག་དར་རྣམས་སམ། མེ་དང་ཐལ་བའམ། བཤང་གཅི་འམ། ཐལ་བ་ཚ་བ་ཐོགས་པ་ཞིག་འོངས་ནས་མགོའི་སྟེང་དུ་བླུགས་སམ། ལུས་ཀྱི་ཡན་ལག་ཀུན་དུ་བརྡུངས་པར་གྱུར་ན། བྱང་ཆུབ་སེམས་དཔས་དེ་ལ་ཞེ་སྡང་དང་འཁོན་གྱི་བསམ་པ་བསྐྱེད་ནས་སེམས་རྣམ་པར་གཡེང་ཞིང་ཁོང་ཁྲོ་བ་བསྐྱེད་པར་ཡང་མི་བྱའོ།
en: When such bodhisattvas are endowed with the perfection of the sameness of the mind and the perfection of the sameness of wisdom—whether they are walking, standing, sitting, lying down, sleeping, or awake—if someone comes along carrying a vessel filled with urine, poison, hot liquid, garbage, fire, ashes, excrement, or embers and pours the content of the vessel on their heads, or strikes their limbs with full force, these bodhisattvas should avoid becoming angry or resentful, thus becoming distracted and aggressive.

source: །འདི་སྐད་དུ་བདག་ལ་ཉེས་པ་ཅི་ཡོད་ཅེས་ཀྱང་སྨྲ་བར་མི་བྱའོ། །གཞན་ཡང་ངན་སེམས་ཀྱིས་དེ་ལ་བལྟ་བར་མི་བྱའོ།
en: They should not even ask, ‘What did I do wrong?’ They should also not regard the other person with hostility.

source: །སེམས་རྩེ་གཅིག་ཏུ་རང་གི་ཆོས་དོན་དུ་གཉེར་ཞིང་གང་བསྒྲུབ་པར་བྱ་བའི་དངོས་པོ་སེམས་རྩེ་གཅིག་ཏུ་མི་སྤོང་བ་དེ་ལྟར་སེམས་ཡོངས་སུ་གདུལ་བར་བྱའོ།
en: Instead, they should tame their minds by one-pointedly pursuing their Dharma practice, without losing a clear focus on the aim of their practice.
